tutorials/Free_Flow_Cases/Hele-Shaw_Capillary_Flow/porous_Boundary/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          46080;
        startFace       45552;
    }
    top
    {
        type            patch;
        nFaces          480;
        startFace       91632;
    }
    bottom
    {
        type            symmetryPlane;
        nFaces          480;
        startFace       92112;
    }
    leftWall
    {
        type            patch;
        nFaces          48;
        startFace       92592;
    }
    rightWall
    {
        type            patch;
        nFaces          48;
        startFace       92640;
    }
)

// ************************************************************************* //
